# Data Preprocessing

In [27]:
import pandas as pd
from sklearn.model_selection import train_test_split

## Data Joining

In [28]:
titanic = pd.read_csv('titanic_new.csv')

In [29]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
titanic.shape

(1309, 12)

(1) buat dataframe a: titanic kolom 1-6, row 1-600  
(2) buat dataframe b: titanic kolom 7-12 + PassengerId, row 1-600  
(3) buat dataframe c: titanic semua kolom, row 601 sampai akhir  
(4) gabungkan a dan b secara horizontal menggunakan kolom 'PassengerId' sebagai acuan, namakan ab (gunakan fungsi merge)   
(5) gabungkanlah ab dan c secara vertikal, namakan abc  
(6) print .head() dan .shape dari abc

In [31]:
a = titanic.iloc[:600, 0:6]
b = titanic.loc[:599, ['PassengerId'] + list(titanic.columns)[6:]]

In [32]:
a.shape

(600, 6)

In [33]:
b.shape

(600, 7)

In [34]:
b.tail()

     PassengerId  SibSp  Parch    Ticket     Fare Cabin Embarked
595          596      1      1    345773  24.1500   NaN        S
596          597      0      0    248727  33.0000   NaN        S
597          598      0      0      LINE   0.0000   NaN        S
598          599      0      0      2664   7.2250   NaN        C
599          600      1      0  PC 17485  56.9292   A20        C

In [35]:
a.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age
595,596,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0
596,597,1,2,"Leitch, Miss. Jessie Wills",female,NaN
597,598,0,3,"Johnson, Mr. Alfred",male,49.0
598,599,0,3,"Boulos, Mr. Hanna",male,NaN
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0

In [36]:
c = titanic.iloc[600:]

In [37]:
ab = pd.merge(a, b, on='PassengerId')
ab

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
595,596,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0,1,1,345773,24.1500,NaN,S
596,597,1,2,"Leitch, Miss. Jessie Wills",female,NaN,0,0,248727,33.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.2250,NaN,C
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,PC 17485,56.9292,A20,C

In [38]:
abc = pd.concat([ab, c], axis=0)
print(abc.head())
print(abc.shape)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
(1309, 12)

## Data Cleaning

Yang perlu dicek pada saat proses data cleaning :  
1. Adanya kesalahan pada tipe data  
2. Duplikat data  
3. Hidden missing data ('?','-',0)

In [43]:
titanic_extra = titanic.tail()

In [44]:
titanic_dup = pd.concat([titanic, titanic_extra], axis=0)

In [46]:
titanic_dup[titanic_dup.duplicated(keep='first')].sort_values('Name')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1305,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1308,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C
1306,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1304,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1307,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S

In [47]:
titanic_clean = titanic_dup.drop_duplicates(keep='first')

In [48]:
titanic_clean[titanic_clean.duplicated(keep='first')]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

1. Pakai dataset churn  
2. Buat churn_extra = churn.tail()  
3. Dengan menggunakan fungsi concat gabungkan churn dan churn_extra secara vertikal  
4. Identifikasi row yang ada duplikatnya menggunakan .duplicate(keep=False)  
5. Drop salah satu row yang ada duplikatnya menggunakan .drop_duplicated (jangan di drop semua)  
6. Pastikan tidak ada lagi duplikat dengan menggunakan .duplicate(keep=False)

In [50]:
churn = pd.read_csv('churn.csv')
churn.tail()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
10122,772366833,Existing Customer,50,M,2,Graduate,Single,$40K - $60K,Blue,40,...,2,3,4003.0,1851,2152.0,0.703,15476,117,0.857,0.462
10123,710638233,Attrited Customer,41,M,2,NaN,Divorced,$40K - $60K,Blue,25,...,2,3,4277.0,2186,2091.0,0.804,8764,69,0.683,0.511
10124,716506083,Attrited Customer,44,F,1,High School,Married,Less than $40K,Blue,36,...,3,4,5409.0,0,5409.0,0.819,10291,60,0.818,0.000
10125,717406983,Attrited Customer,30,M,2,Graduate,NaN,$40K - $60K,Blue,36,...,3,3,5281.0,0,5281.0,0.535,8395,62,0.722,0.000
10126,714337233,Attrited Customer,43,F,2,Graduate,Married,Less than $40K,Silver,25,...,2,4,10388.0,1961,8427.0,0.703,10294,61,0.649,0.189

In [51]:
churn_extra = churn.tail()

In [52]:
churn_dup = pd.concat([churn, churn_extra], axis=0)

In [53]:
churn_dup[churn_dup.duplicated(keep=False)]

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
10122,772366833,Existing Customer,50,M,2,Graduate,Single,$40K - $60K,Blue,40,...,2,3,4003.0,1851,2152.0,0.703,15476,117,0.857,0.462
10123,710638233,Attrited Customer,41,M,2,NaN,Divorced,$40K - $60K,Blue,25,...,2,3,4277.0,2186,2091.0,0.804,8764,69,0.683,0.511
10124,716506083,Attrited Customer,44,F,1,High School,Married,Less than $40K,Blue,36,...,3,4,5409.0,0,5409.0,0.819,10291,60,0.818,0.000
10125,717406983,Attrited Customer,30,M,2,Graduate,NaN,$40K - $60K,Blue,36,...,3,3,5281.0,0,5281.0,0.535,8395,62,0.722,0.000
10126,714337233,Attrited Customer,43,F,2,Graduate,Married,Less than $40K,Silver,25,...,2,4,10388.0,1961,8427.0,0.703,10294,61,0.649,0.189
10122,772366833,Existing Customer,50,M,2,Graduate,Single,$40K - $60K,Blue,40,...,2,3,4003.0,1851,2152.0,0.703,15476,117,0.857,0.462
10123,710638233,Attrited Customer,41,M,2,NaN,Divorced,$40K - $60K,Blue,25,...,2,3,4277.0,2186,2091.0,0.804,8764,69,0.683,0.511
10124,716506083,Attrited Customer,44,F,1,High School,Married,Less than $40K,Blue,36,...,3,4,5409.0,0,5409.0,0.819,10291,60,0.818,0.000
10125,717406983,Attrited Customer,30,M,2,Graduate,NaN,$40K - $60K,Blue,36,...,3,3,5281.0,0,5281.0,0.535,8395,62,0.722,0.000
10126,714337233,Attrited Customer,43,F,2,Graduate,Married,Less than $40K,Silver,25,...,2,4,10388.0,1961,8427.0,0.703,10294,61,0.649,0.189

In [54]:
churn_clean = churn_dup.drop_duplicates(keep='first')

In [55]:
churn_clean[churn_clean.duplicated(keep=False)]

Empty DataFrame
Columns: [CLIENTNUM, Attrition_Flag, Customer_Age, Gender, Dependent_count, Education_Level, Marital_Status, Income_Category, Card_Category, Months_on_book, Total_Relationship_Count, Months_Inactive_12_mon, Contacts_Count_12_mon, Credit_Limit, Total_Revolving_Bal, Avg_Open_To_Buy, Total_Amt_Chng_Q4_Q1, Total_Trans_Amt, Total_Trans_Ct, Total_Ct_Chng_Q4_Q1, Avg_Utilization_Ratio]
Index: []

[0 rows x 21 columns]

## Train Test Split

1. pisahkan X (fitur prediktor) dan y (label) dari titanic  
2. lakukan train_test_split (test_size = 0.2, stratify = y) yang menghasilkan X_train, X_test, y_train, y_test  
3. print .head(), type(), dan .shape dari masing-masing variabel

In [39]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
X = titanic.drop('Survived', axis=1)
y = titanic['Survived']

In [41]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, stratify=y, random_state=42)

In [42]:
for set in [X_train, X_test, y_train, y_test]:
    print(set.head())
    print(type(set))
    print(set.shape)
    print('---')

      PassengerId  Pclass                                               Name  \
1021         1022       3                            Spinner, Mr. Henry John
318           319       1                           Wick, Miss. Mary Natalie
924           925       3  Johnston, Mrs. Andrew G (Elizabeth Lily" Watson)"
652           653       3                     Kalvik, Mr. Johannes Halvorsen
1189         1190       1                         Loring, Mr. Joseph Holland

         Sex   Age  SibSp  Parch           Ticket      Fare Cabin Embarked
1021    male  32.0      0      0  STON/OQ. 369943    8.0500   NaN        S
318   female  31.0      0      2            36928  164.8667    C7        S
924   female   NaN      1      2       W./C. 6607   23.4500   NaN        S
652     male  21.0      0      0             8475    8.4333   NaN        S
1189    male  30.0      0      0           113801   45.5000   NaN        S
<class 'pandas.core.frame.DataFrame'>
(1047, 11)
---
      PassengerId  Pclass                         Name     Sex   Age  SibSp  \
950           951       1  Chaudanson, Miss. Victorine  female  36.0      0
811           812       3            Lester, Mr. James    male  39.0      0
475           476       1  Clifford, Mr. George Quincy    male   NaN      0
1136         1137       1      Kenyon, Mr. Frederick R    male  41.0      1
137           138       1  Futrelle, Mr. Jacques Heath    male  37.0      1

      Parch     Ticket      Fare Cabin Embarked
950       0   PC 17608  262.3750   B61        C
811       0  A/4 48871   24.1500   NaN        S
475       0     110465   52.0000   A14        S
1136      0      17464   51.8625   D21        S
137       0     113803   53.1000  C123        S
<class 'pandas.core.frame.DataFrame'>
(262, 11)
---
1021    0
318     1
924     1
652     0
1189    0
Name: Survived, dtype: int64
<class 'pandas.core.series.Series'>
(1047,)
---
950     1
811     0
475     0
1136    0
137     0
Name: Survived, dtype: int64
<class 'pandas.core.series.Series'>
(262,)
---